varigit/freertos-variscite/boards/dart_mx8mp/cmsis_driver_examples/ecspi/sdma_loopback_transfer/pin_mux.h
/*
 * Copyright 2019-2021 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 *
 */


#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

#include "board.h"

/***********************************************************************************************************************
 * Definitions
 **********************************************************************************************************************/

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif


/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);                                 /*!< Function assigned for the core: Cortex-M7F[m7] */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void ECSPI1_DeinitPins(void);                              /*!< Function assigned for the core: Cortex-M7F[m7] */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void ECSPI1_InitPins(void);                                /*!< Function assigned for the core: Cortex-M7F[m7] */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
